export default {
  state: {
    ads: [
      {
        id: '1',
        name: 'Clash Of clans1',
        category: 'Игры',
        description: 'Clash of Clans – легендарная стратегия, собравшая вокруг себя миллионы людей со всего мира. Присоединяйтесь и вы и начинайте строить свою базу, нанимать войски и очень-очень много воевать. На нашем портале вы найдете мод Clash of Clans скачать который можно совершенно бесплатно. В пакете мода вы получите максимум всех ресурсов, а также бесконечные кристаллы, которые можно потратить куда угодно. \n' +
        '\n' +
        'Вас ждут десятки типов войск, большое разнообразие построек для развития войска, шахты, добывающие эликсир и нефть, оборонительные постройки и конечно – полностью оптимизированный и продуманный баланс, с которым наверняка не будет скучно. Миллионы пользователей со всего мира, крупные баталии, войны кланов, в которые, вы, конечно, можете вступить! \n' +
        '\n' +
        'Выигрывайте как можно больше ресурсов и ставьте на прокачку ваши здания, ведь если все оставить на минимальном уровне вашу базу будет очень легко повредить. Но если вы решите скачать мод Clash of Clans бесплатно, то проблем с развитием не будет, и вы будете только воевать и наслаждаться игрой! Нанимайте варваров, шары с бомбами, магов, гигантов и других существ, которые сделают все, чтобы победить!',
        miniDescription: 'Clash of Clans – легендарная стратегия, собравшая вокруг себя...',
        appVersion: '11.49.9',
        androidVersion: '4+',
        developer: 'SUPERCELL',
        marketLink: '',
        youTubeLink: '',
        logo: 'https://i.pinimg.com/236x/4b/9e/48/4b9e487c473be98be7202ae7b7a4a17c--clash-clans-clash-of-clans-game.jpg',
        img: [
          'https://cdn-images-1.medium.com/max/2000/1*6UxlCSE3hYFH6lSIHhaySA.jpeg',
          'https://cdn-images-1.medium.com/max/2000/1*6UxlCSE3hYFH6lSIHhaySA.jpeg',
          'https://cdn-images-1.medium.com/max/2000/1*6UxlCSE3hYFH6lSIHhaySA.jpeg',
          'https://cdn-images-1.medium.com/max/2000/1*6UxlCSE3hYFH6lSIHhaySA.jpeg'
        ],
        promo: true,
        author: 'Admin',
        date: 'Январь',
        viewCounter: 15,
        comments: [
          {author: 'Author1', comment: 'Nice!', date: null},
          {author: 'Author2', comment: 'Good!!!', date: null}]
      },
      {
        id: '2',
        name: 'Clash Of clans2',
        category: 'Игры',
        description: 'Clash of Clans – легендарная стратегия, собравшая вокруг себя миллионы людей со всего мира. Присоединяйтесь и вы и начинайте строить свою базу, нанимать войски и очень-очень много воевать. На нашем портале вы найдете мод Clash of Clans скачать который можно совершенно бесплатно. В пакете мода вы получите максимум всех ресурсов, а также бесконечные кристаллы, которые можно потратить куда угодно. \n' +
        '\n' +
        'Вас ждут десятки типов войск, большое разнообразие построек для развития войска, шахты, добывающие эликсир и нефть, оборонительные постройки и конечно – полностью оптимизированный и продуманный баланс, с которым наверняка не будет скучно. Миллионы пользователей со всего мира, крупные баталии, войны кланов, в которые, вы, конечно, можете вступить! \n' +
        '\n' +
        'Выигрывайте как можно больше ресурсов и ставьте на прокачку ваши здания, ведь если все оставить на минимальном уровне вашу базу будет очень легко повредить. Но если вы решите скачать мод Clash of Clans бесплатно, то проблем с развитием не будет, и вы будете только воевать и наслаждаться игрой! Нанимайте варваров, шары с бомбами, магов, гигантов и других существ, которые сделают все, чтобы победить!',
        miniDescription: 'Clash of Clans – легендарная стратегия, собравшая вокруг себя...',
        appVersion: '11.49.9',
        androidVersion: '4+',
        developer: 'SUPERCELL',
        marketLink: '',
        youTubeLink: '',
        logo: 'https://i.pinimg.com/236x/4b/9e/48/4b9e487c473be98be7202ae7b7a4a17c--clash-clans-clash-of-clans-game.jpg',
        img: [
          'https://cdn-images-1.medium.com/max/2000/1*6UxlCSE3hYFH6lSIHhaySA.jpeg',
          'https://cdn-images-1.medium.com/max/2000/1*6UxlCSE3hYFH6lSIHhaySA.jpeg',
          'https://cdn-images-1.medium.com/max/2000/1*6UxlCSE3hYFH6lSIHhaySA.jpeg',
          'https://cdn-images-1.medium.com/max/2000/1*6UxlCSE3hYFH6lSIHhaySA.jpeg'
        ],
        promo: false,
        author: '',
        date: null,
        viewCounter: 0,
        comments: []
      },
      {
        id: '3',
        name: 'Clash Of clans3',
        category: 'Игры',
        description: 'Clash of Clans – легендарная стратегия, собравшая вокруг себя миллионы людей со всего мира. Присоединяйтесь и вы и начинайте строить свою базу, нанимать войски и очень-очень много воевать. На нашем портале вы найдете мод Clash of Clans скачать который можно совершенно бесплатно. В пакете мода вы получите максимум всех ресурсов, а также бесконечные кристаллы, которые можно потратить куда угодно. \n' +
        '\n' +
        'Вас ждут десятки типов войск, большое разнообразие построек для развития войска, шахты, добывающие эликсир и нефть, оборонительные постройки и конечно – полностью оптимизированный и продуманный баланс, с которым наверняка не будет скучно. Миллионы пользователей со всего мира, крупные баталии, войны кланов, в которые, вы, конечно, можете вступить! \n' +
        '\n' +
        'Выигрывайте как можно больше ресурсов и ставьте на прокачку ваши здания, ведь если все оставить на минимальном уровне вашу базу будет очень легко повредить. Но если вы решите скачать мод Clash of Clans бесплатно, то проблем с развитием не будет, и вы будете только воевать и наслаждаться игрой! Нанимайте варваров, шары с бомбами, магов, гигантов и других существ, которые сделают все, чтобы победить!',
        miniDescription: 'Clash of Clans – легендарная стратегия, собравшая вокруг себя...',
        appVersion: '11.49.9',
        androidVersion: '4+',
        developer: 'SUPERCELL',
        marketLink: '',
        youTubeLink: '',
        logo: 'https://i.pinimg.com/236x/4b/9e/48/4b9e487c473be98be7202ae7b7a4a17c--clash-clans-clash-of-clans-game.jpg',
        img: [
          'https://cdn-images-1.medium.com/max/2000/1*6UxlCSE3hYFH6lSIHhaySA.jpeg',
          'https://cdn-images-1.medium.com/max/2000/1*6UxlCSE3hYFH6lSIHhaySA.jpeg',
          'https://cdn-images-1.medium.com/max/2000/1*6UxlCSE3hYFH6lSIHhaySA.jpeg',
          'https://cdn-images-1.medium.com/max/2000/1*6UxlCSE3hYFH6lSIHhaySA.jpeg'
        ],
        promo: true,
        author: '',
        date: null,
        viewCounter: 0,
        comments: []
      },
      {
        id: '4',
        name: 'Uber1',
        category: 'Приложения',
        description: 'Clash of Clans – легендарная стратегия, собравшая вокруг себя миллионы людей со всего мира. Присоединяйтесь и вы и начинайте строить свою базу, нанимать войски и очень-очень много воевать. На нашем портале вы найдете мод Clash of Clans скачать который можно совершенно бесплатно. В пакете мода вы получите максимум всех ресурсов, а также бесконечные кристаллы, которые можно потратить куда угодно. \n' +
        '\n' +
        'Вас ждут десятки типов войск, большое разнообразие построек для развития войска, шахты, добывающие эликсир и нефть, оборонительные постройки и конечно – полностью оптимизированный и продуманный баланс, с которым наверняка не будет скучно. Миллионы пользователей со всего мира, крупные баталии, войны кланов, в которые, вы, конечно, можете вступить! \n' +
        '\n' +
        'Выигрывайте как можно больше ресурсов и ставьте на прокачку ваши здания, ведь если все оставить на минимальном уровне вашу базу будет очень легко повредить. Но если вы решите скачать мод Clash of Clans бесплатно, то проблем с развитием не будет, и вы будете только воевать и наслаждаться игрой! Нанимайте варваров, шары с бомбами, магов, гигантов и других существ, которые сделают все, чтобы победить!',
        miniDescription: 'Clash of Clans – легендарная стратегия, собравшая вокруг себя...',
        appVersion: '11.49.9',
        androidVersion: '4+',
        developer: 'SUPERCELL',
        marketLink: '',
        youTubeLink: '',
        logo: 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSqsAXQ4AO_jIxpTleuTkCh5hZD2FT8bPNhqMyhDr041j1W4IURkQ',
        img: [
          'https://biz.nv.ua/img/article/24797/20_main.jpeg',
          'https://biz.nv.ua/img/article/24797/20_main.jpeg',
          'https://biz.nv.ua/img/article/24797/20_main.jpeg',
          'https://biz.nv.ua/img/article/24797/20_main.jpeg'
        ],
        promo: true,
        author: '',
        date: null,
        viewCounter: 0,
        comments: []
      },
      {
        id: '5',
        name: 'Uber2',
        category: 'Приложения',
        description: 'Clash of Clans – легендарная стратегия, собравшая вокруг себя миллионы людей со всего мира. Присоединяйтесь и вы и начинайте строить свою базу, нанимать войски и очень-очень много воевать. На нашем портале вы найдете мод Clash of Clans скачать который можно совершенно бесплатно. В пакете мода вы получите максимум всех ресурсов, а также бесконечные кристаллы, которые можно потратить куда угодно. \n' +
        '\n' +
        'Вас ждут десятки типов войск, большое разнообразие построек для развития войска, шахты, добывающие эликсир и нефть, оборонительные постройки и конечно – полностью оптимизированный и продуманный баланс, с которым наверняка не будет скучно. Миллионы пользователей со всего мира, крупные баталии, войны кланов, в которые, вы, конечно, можете вступить! \n' +
        '\n' +
        'Выигрывайте как можно больше ресурсов и ставьте на прокачку ваши здания, ведь если все оставить на минимальном уровне вашу базу будет очень легко повредить. Но если вы решите скачать мод Clash of Clans бесплатно, то проблем с развитием не будет, и вы будете только воевать и наслаждаться игрой! Нанимайте варваров, шары с бомбами, магов, гигантов и других существ, которые сделают все, чтобы победить!',
        miniDescription: 'Clash of Clans – легендарная стратегия, собравшая вокруг себя...',
        appVersion: '11.49.9',
        androidVersion: '4+',
        developer: 'SUPERCELL',
        marketLink: '',
        youTubeLink: '',
        logo: 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSqsAXQ4AO_jIxpTleuTkCh5hZD2FT8bPNhqMyhDr041j1W4IURkQ',
        img: [
          'https://biz.nv.ua/img/article/24797/20_main.jpeg',
          'https://biz.nv.ua/img/article/24797/20_main.jpeg',
          'https://biz.nv.ua/img/article/24797/20_main.jpeg',
          'https://biz.nv.ua/img/article/24797/20_main.jpeg'
        ],
        promo: false
      },
      {
        id: '6',
        name: 'Uber3',
        category: 'Приложения',
        description: 'Clash of Clans – легендарная стратегия, собравшая вокруг себя миллионы людей со всего мира. Присоединяйтесь и вы и начинайте строить свою базу, нанимать войски и очень-очень много воевать. На нашем портале вы найдете мод Clash of Clans скачать который можно совершенно бесплатно. В пакете мода вы получите максимум всех ресурсов, а также бесконечные кристаллы, которые можно потратить куда угодно. \n' +
        '\n' +
        'Вас ждут десятки типов войск, большое разнообразие построек для развития войска, шахты, добывающие эликсир и нефть, оборонительные постройки и конечно – полностью оптимизированный и продуманный баланс, с которым наверняка не будет скучно. Миллионы пользователей со всего мира, крупные баталии, войны кланов, в которые, вы, конечно, можете вступить! \n' +
        '\n' +
        'Выигрывайте как можно больше ресурсов и ставьте на прокачку ваши здания, ведь если все оставить на минимальном уровне вашу базу будет очень легко повредить. Но если вы решите скачать мод Clash of Clans бесплатно, то проблем с развитием не будет, и вы будете только воевать и наслаждаться игрой! Нанимайте варваров, шары с бомбами, магов, гигантов и других существ, которые сделают все, чтобы победить!',
        miniDescription: 'Clash of Clans – легендарная стратегия, собравшая вокруг себя...',
        appVersion: '11.49.9',
        androidVersion: '4+',
        developer: 'SUPERCELL',
        marketLink: '',
        youTubeLink: '',
        logo: 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSqsAXQ4AO_jIxpTleuTkCh5hZD2FT8bPNhqMyhDr041j1W4IURkQ',
        img: [
          'https://biz.nv.ua/img/article/24797/20_main.jpeg',
          'https://biz.nv.ua/img/article/24797/20_main.jpeg',
          'https://biz.nv.ua/img/article/24797/20_main.jpeg',
          'https://biz.nv.ua/img/article/24797/20_main.jpeg'
        ],
        promo: true,
        author: '',
        date: null,
        viewCounter: 0,
        comments: []
      }
    ]
  },
  mutations: {
  },
  actions: {
  },
  getters: {
    ads (state) {
      return state.ads
    },
    apps (state) {
      return state.ads.filter(ad => {
        if (ad.category === 'Приложения') return ad
      })
    },
    games (state) {
      return state.ads.filter(ad => {
        if (ad.category === 'Игры') return ad
      })
    },
    promoApps (state) {
      return state.ads.filter(ad => {
        if (ad.category === 'Приложения' && ad.promo) return ad
      })
    },
    promoGames (state) {
      return state.ads.filter(ad => {
        if (ad.category === 'Игры' && ad.promo) return ad
      })
    },
    adById (state) {
      return adId => {
        return state.ads.find(ad => ad.id === adId)
      }
    }
  }
}
